# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [2]:
# 載入 NumPy, Pandas 套件
import numpy as np
import pandas as pd

# 檢查正確載入與版本
print(np)
print(np.__version__)
print(pd)
print(pd.__version__)

<module 'numpy' from '/opt/anaconda3/lib/python3.7/site-packages/numpy/__init__.py'>
1.17.2
<module 'pandas' from '/opt/anaconda3/lib/python3.7/site-packages/pandas/__init__.py'>
0.25.1

In [3]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [25]:
# - 計算每個不同種類 animal 的 age 的平均數
print('cat', df[df['animal'] == 'cat']['age'].mean())
print('snake', df[df['animal'] == 'snake']['age'].mean())
print('dog', df[df['animal'] == 'dog']['age'].mean())
print('===========')

# - 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
print(df.sort_values(by=['age', 'visits'], ascending=[True, False]))
print('===========')

# - 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
df['priority'] = df['priority'] == 'yes'
print(df)

cat 2.5
snake 2.5
dog 5.0
===========
  animal  age  visits  priority
c  snake  0.5       2     False
f    cat  2.0       3     False
a    cat  2.5       1     False
b    cat  3.0       3     False
j    dog  3.0       1     False
g  snake  4.5       1     False
e    dog  5.0       2     False
i    dog  7.0       2     False
d    dog  NaN       3     False
h    cat  NaN       1     False
===========
  animal  age  visits  priority
a    cat  2.5       1     False
b    cat  3.0       3     False
c  snake  0.5       2     False
d    dog  NaN       3     False
e    dog  5.0       2     False
f    cat  2.0       3     False
g  snake  4.5       1     False
h    cat  NaN       1     False
i    dog  7.0       2     False
j    dog  3.0       1     False

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [30]:
# 該欄位的平均數
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.761431  0.011263  0.017805
1  0.052560  0.076406  0.025867
2  0.375061  0.761721  0.568120
3  0.375611  0.129189  0.409878
4  0.291427  0.323371  0.403035

In [33]:
df - df.mean()

          0         1         2
0  0.390213 -0.249127 -0.267137
1 -0.318658 -0.183984 -0.259074
2  0.003843  0.501331  0.283179
3  0.004393 -0.131201  0.124937
4 -0.079791  0.062981  0.118094

In [35]:
# 該筆資料平均數
print(df.mean(axis=1))
df - df.mean(axis=1)

0    0.263500
1    0.051611
2    0.568301
3    0.304893
4    0.339278
dtype: float64

          0         1         2   3   4
0  0.497932 -0.040348 -0.550496 NaN NaN
1 -0.210940  0.024795 -0.542433 NaN NaN
2  0.111562  0.710110 -0.000181 NaN NaN
3  0.112111  0.077578 -0.158423 NaN NaN
4  0.027927  0.271760 -0.165265 NaN NaN

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [41]:
print(df.sum(axis=1))
print(df.sum(axis=1).min())
print(df.sum(axis=1).idxmin())

0    0.790499
1    0.154833
2    1.704902
3    0.914678
4    1.017833
dtype: float64
0.15483319190488232
1

In [42]:
print(df.sum(axis=0))
print(df.sum(axis=0).min())
print(df.sum(axis=0).idxmin())

0    1.856090
1    1.301951
2    1.424705
dtype: float64
1.3019505702532197
1